Console.Clear();
Console.WriteLine("Seminar 03, Mass Homework");
Console.WriteLine("");
//======================================================================================= Task 01
// Задайте одномерный массив из 10 целых чисел от 1 до 100.
// Найдите количество элементов массива, значения которых лежат в отрезке [10,90].

double[] array = { 0.25, 5.4, 1.3, 2.1, 3.8, 5.2, 3.01 };

///////////////
int i0 = 0;
Console.Write("The mass is ");
while (i0 < 7)
{
    Console.Write(array[i0] + " ");
    i0 = i0 + 1;
}
////////////////



//////////////////////////////////////// MIN

double FindMin = array[0];
for (int i = 0; i < 7; i = i + 1)
{
    if (FindMin > array[i])
    {
        FindMin = array[i];
    }
}

//////////////////////////////////////// MAX

double FindMax = array[0];
for (int i = 0; i < 7; i = i + 1)
{
    if (FindMax < array[i])
    {
        FindMax = array[i];
    }
}


double PrintResult = FindMax - FindMin;
Console.WriteLine (" ");
Console.WriteLine ("Findmax is " + FindMax);
Console.WriteLine ("Findmin is " + FindMin);

Console.WriteLine ("Result is " + PrintResult);

//======================================================================================= Task 01


//======================================================================================= Task 02
// Задайте массив на 10 целых чисел.
// Напишите программу, которая определяет количество чётных чисел в массиве.



//======================================================================================= Task 02


//======================================================================================= Task 03
// Задайте массив из вещественных чисел с ненулевой дробной частью.
// Найдите разницу между максимальным и минимальным элементов массива.



//======================================================================================= Task 03