Console.Clear();
Console.WriteLine("Seminar 02, Simple Algoritms");
Console.WriteLine("");

// //=================================================================================================01
// // Напишите программу, которая выводит случайное число из отрезка и показывает наибольшую
// // цифру числа диапазон от 10 до 99
// // например  47, большее 7

// int num = new Random().Next(10,100);
// Console.WriteLine(num + " is the random number");

// int num1 = num/10; // получаем десятки - первое число
// int num2 = num %10; // получаем остаток - второе число

// if (num1 > num2)
// {
//     System.Console.WriteLine(num1 + " are the biggest");
// }
// else if(num1== num2)
// {
//     System.Console.WriteLine("numbers are the simple");
// }
// else 
// {
//     System.Console.WriteLine(num2 + " are the biggest");
// }

// //=================================================================================================01

// //=================================================================================================02
// // Напишите программу которая выведет случайное трехзначное число 
// // и уберет 2ю цифру этого числа.
// // пример - 473, 43

// int num = new Random().Next(100,1000);
// Console.WriteLine(num + " is the random number");
// int result = num/100*10 + num%10; // 4*10 + 6 = 46 при числе к примеру 456
// Console.WriteLine("1st and 3rd together is " + result);

// //=================================================================================================02

// //=================================================================================================03
// Напишите программу которая на вход будет принимать два числа и 
// на выходи выдавать, будет ли второе число кратным 1 му
// к примеру = 2 не кратно 1, программа выводит остаток

// Console.WriteLine("Add the 1st number");
// int num1 = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Add the 2st number");
// int num2 = int.Parse(Console.ReadLine()); // конверт инпарс работает только из стринг в число

// if (num1 % num2 ==0)
// {
//     Console.WriteLine("Yes");
// }
// else
// {
//     Console.WriteLine("no, " + num1%num2); //
//     Console.WriteLine($"не кратно, ост. {num1%num2}"); // интерполяция
// }
// //=================================================================================================03

// //=================================================================================================04
// // Напишите программу, которая принимает на 
// // вход число и проверяет, кратно ли оно одновременно 
// // 7 и 23.

// Console.WriteLine("Add the number");
// int num = Convert.ToInt32(Console.ReadLine());

// if (num % 7 == 0 && num % 23 ==0) // && - и 1 и 2, || - хотя бы 
// {
//     Console.WriteLine("Yes");
// }
// else
// {
//     Console.WriteLine("no"); 
// }
// //=================================================================================================04

// //=================================================================================================05
// // Напишите программу, которая на вход принимает два числа, 
// // и проверяет одно число квадратом другого.

// Console.WriteLine("Add the 1st number");
// int num1 = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Add the 2st number");
// int num2 = int.Parse(Console.ReadLine()); // альтернатива конверт инпарс работает только из стринг в число
// if (num1 == num2*num2 || num2 == num1*num1)
// {
//     Console.WriteLine("Yes");
// }
// else
// {
//     Console.WriteLine("no"); 
// }
// //=================================================================================================05