Console.Clear();
Console.WriteLine("Seminar 02, Simple Algoritms");
Console.WriteLine("");

// //=================================================================================================01
// // Напишите программу, которая выводит случайное число из отрезка и показывает наибольшую
// // цифру числа диапазон от 10 до 99
// // например  47, большее 7

// int num = new Random().Next(10,100);
// Console.WriteLine(num + " is the random number");

// int num1 = num/10; // получаем десятки - первое число
// int num2 = num %10; // получаем остаток - второе число

// if (num1 > num2)
// {
//     System.Console.WriteLine(num1 + " are the biggest");
// }
// else if(num1== num2)
// {
//     System.Console.WriteLine("numbers are the simple");
// }
// else 
// {
//     System.Console.WriteLine(num2 + " are the biggest");
// }

// //=================================================================================================01

// //=================================================================================================02
// // Напишите программу которая выведет случайное трехзначное число 
// // и уберет 2ю цифру этого числа.
// // пример - 473, 43

// int num = new Random().Next(100,1000);
// Console.WriteLine(num + " is the random number");
// int result = num/100*10 + num%10; // 4*10 + 6 = 46 при числе к примеру 456
// Console.WriteLine("1st and 3rd together is " + result);

// //=================================================================================================02

//=================================================================================================03
