Console.Clear();
Console.WriteLine("Sem 3");
Console.WriteLine("");

//============================================================================ Theory
// int[] array = new int[5];//Создание массива

// for (int i = 0; i < 5; i = i + 1)//for or while
// {
//     array[i] = new Random().Next(1, 10);// заполнение массива
//     Console.Write(array[i] + " ");//вывод массива
// }
//============================================================================ Theory

// //============================================================================ Task 01
// //Задайте массив и напишите программу, которая проверяет присутствует ли заданное число в массиве.
// //Программа должна выдать ответ да/нет


// Console.WriteLine("Add the random number between 1 and 10");
// int num = Convert.ToInt32(Console.ReadLine());
// string isFind = "No";



// int[] array = new int[5];
// for (int i = 0; i < array.Length; i = i + 1)
// {
//     array[i] = new Random().Next(1, 10);
//     Console.Write(array[i] + " ");

//     if(num==array[i])
//     {
//         isFind = "Yes";
//     }
// }
// Console.WriteLine(" ");
// Console.WriteLine(isFind);
// //============================================================================ Task 01

// //============================================================================ Task 02
// // Задайте массив из 10 элементов заполненный числами от -10 до 10,
// // поменяйте все знаки + и - на противоположные

// int[] array = new int[5];
// for (int i = 0; i < array.Length; i = i + 1)
// {
//     array[i] = new Random().Next(-10, 11);
//     Console.Write(array[i] + "\t");
// }

// Console.WriteLine(" ");

// for (int i = 0; i < array.Length; i = i + 1)
// {
//     array[i] = array[i] * -1;
//     Console.Write(array[i] + "\t ");
// }

// //============================================================================ Task 02


//============================================================================ Task 03
// Задайте массив и напишите программу которая перемножает пару чисел первое и последнее число массива,
//  второе и предпоследнее и тд. и записать в новый массив.
//пример [1 3 2 4 2 3] => [3 6 8]
// Найдите произведения пар чисел в одномерном массиве. Парой
// считаем первый и последний элемент, второй и предпоследний и
// т.д. Результат запишите в новый массив.
// Пример
// [1 3 2 4 2 3] => [3 6 8]   6
// [2 3 1 7 5 6 3] => [6 18 5] (элемент 7 не имеет пары)

// System.Console.WriteLine("Введите число");
// int size = Convert.ToInt32(Console.ReadLine());

// int[] array = new int[size];
// int[] array2 = new int[size/2];

// for (int i = 0; i < array.Length; i++) // вывод первого массива
// {
//     array[i] = new Random().Next(-10,11);
//     System.Console.Write(array[i]+ "\t");
// }

// System.Console.WriteLine();

// for (int i = 0; i < array2.Length; i++) // вывод второго массива на перемножение
// {
//     array2[i] = array[i]* array[size-1-i];
//     System.Console.Write(array2[i]+ "\t");
// }
//============================================================================ Task 03
//============================================================================ Task 03