//Console.Clear();
// Console.WriteLine("Lesson 5, Mass and string, Homework by SEREDENKO IURY");
// Console.WriteLine("");

//=================================================================================== Task 01
// Задача 1: Задайте двумерный массив символов (тип char [,]).
// Создать строку из символов этого массива.
// Инициализация двумерного массива символов

// char[,] charArray = new char[,] { { 'a', 'b' }, { 'c', 'd' } };
// //Метод для создания строки из двумерного массива символов
// string CreateStringFrom2DArray(char[,] array)
// {
//     string result2 = "";
//     for (int i = 0; i < charArray.GetLength(0); i++)
//     {
//         for (int j = 0; j < charArray.GetLength(1); j++)
//         {
//             // Добавление каждого символа в результирующую строку
//             result2 = result2 + array[i, j];
//         }
//     }
//     return result2;
// }
// Console.WriteLine(CreateStringFrom2DArray(charArray));

//=================================================================================== Task 01

//=================================================================================== Task 02
// Задача 2: Задайте строку, содержащую латинские буквы в обоих регистрах.
// Сформируйте строку, в которой все заглавные буквы заменены на строчные.

// System.Console.WriteLine("Введите срочку");
// string userInput = Console.ReadLine();
// System.Console.WriteLine();
// Console.WriteLine(userInput.ToLower());

//=================================================================================== Task 02

//=================================================================================== Task 03
// // Задача 3: Задайте произвольную строку. Выясните, является ли она палиндромом.
 
// System.Console.WriteLine("Введите срочку");
// string str = Console.ReadLine();
// char[] palend = new char[str.Length];

// //====================================== FUNCTIONS =================================

// void ShowMatrix(char[] matrix)
// {
//         for (int i = 0; i < matrix.Length; i++)
//     {
//         matrix[i] = str[i];
//         Console.Write(matrix[i] + " ");
      
//     }
// }

// bool PalnotPal (char[] matrix)
// {
//     for (int i = 0; i < matrix.Length; i++)
//         {
//             if (matrix[i] == matrix[matrix.Length - i - 1]) {}  
//             else return false;
//         }
//         return true;
// }
// //======================================== MAIN ===================================
// ShowMatrix(palend);
// Console.WriteLine();
// Console.Write(PalnotPal(palend));
//=================================================================================== Task 03



//=================================================================================== Task 04
// Задача 4*(не обязательная): Задайте строку, состоящую из слов, 
// разделенных пробелами. Сформировать строку, в которой слова расположены в обратном порядке.
// В полученной строке слова должны быть также разделены пробелами.

////////// ОБЯЗАТЕЛЬНО СДЕЛАЮ И ПРИКРЕПЛЮ ПОЗЖЕ

//=================================================================================== Task 04
